Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.SetCellCombinedParameters(System.Int32,System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Allows the caller to set combined parameter for a specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.GetCustomFieldId(System.Int32,System.Int32)
Gets custom field id from the cell.
row:
The row of the cell.
col:
The column of the cell.
Returns:
Returns custom field id from the cell.
If this cell is not of type CellType.CustomField it will return an empty Guid
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number row is invalid.
-or-
The given column number col is invalid.
Since:
2024

Autodesk.Revit.DB.TableSectionData.SetCellCalculatedValue(System.Int32,Autodesk.Revit.DB.TableCellCalculatedValueData)
Allows the caller to set the calculated value for a specified column
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule header sections.
-or-
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellCalculatedValue(System.Int32,System.Int32,Autodesk.Revit.DB.TableCellCalculatedValueData)
Allows the caller to set the calculated value for a specified cell
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule header sections.
-or-
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellParamIdAndCategoryId(System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets a column's category and parameter Id
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
-or-
The paramId or categoryId is not acceptable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellParamIdAndCategoryId(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets a cell's category and parameter Id
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The paramId or categoryId is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.IsAcceptableParamIdAndCategoryId(System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
nRow:
row index
Returns:
True if the ParamId and CategoryId are all valid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.IsAcceptableParamIdAndCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Identifies if the given parameter id and category id can be assigned to a cell in this table.
Returns:
True if the ParamId and CategoryId are all acceptable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.SetCellFormatOptions(System.Int32,System.Int32,Autodesk.Revit.DB.FormatOptions)
Sets a cell's FormatOptions.
nRow:
The row index of the cell
nCol:
The column index of the cell
options:
The format option to assign
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The display unit in options is not a valid display unit for the unit type of the cell, or the rounding method in options is not set to Nearest. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.TableSectionData.GetCellSpec(System.Int32,System.Int32)
Gets the spec describing values of a cell, if applicable.
nRow:
The row index of the cell
nCol:
The column index of the cell
Returns:
Identifier of the spec, or empty if the cell does not contain a number with units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.GetCellFormatOptions(System.Int32,Autodesk.Revit.DB.Document)
Returns a column's cell FormatOptions and if no FormatOptions exists for this column,
it would come from the section.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.GetCellFormatOptions(System.Int32,System.Int32,Autodesk.Revit.DB.Document)
Returns a cell's FormatOptions and if no FormatOptions exists for this cell,
it would come from the column, or the row, or the section.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.SetCellType(System.Int32,Autodesk.Revit.DB.CellType)
Sets a column's cell type
Throws Autodesk.Revit.Exceptions.ArgumentException:
A CellType.CustomField can't be set.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellType(System.Int32,System.Int32,Autodesk.Revit.DB.CellType)
Sets a cell's Type
Throws Autodesk.Revit.Exceptions.ArgumentException:
A CellType.CustomField can't be set.
-or-
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellStyle(Autodesk.Revit.DB.TableCellStyle)
Sets a section's style
Remarks:
For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this section.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.SetCellStyle(System.Int32,Autodesk.Revit.DB.TableCellStyle)
Sets a column's style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.SetCellStyle(System.Int32,System.Int32,Autodesk.Revit.DB.TableCellStyle)
Sets a cell's style
Remarks:
For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this cell.
The global base format controls any non-overridden characteristics of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Only allow to override cell style for header section or column header in body section.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableSectionData.MergeCells(Autodesk.Revit.DB.TableMergedCell)
Merges cells for the given area.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given TableMergedCell mergedCell is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetMergedCell(System.Int32,System.Int32,Autodesk.Revit.DB.TableMergedCell)
Sets the merged cell that this cell is a part of.
nRow:
The cell row.
nCol:
The cell column.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
The given TableMergedCell mergedCell is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetCellText(System.Int32,System.Int32,System.String)
Sets a cell's to display the specified text.
Remarks:
If this cell's type is not CellType.Text, and the operation is permitted on this cell, the cell type
will be changed to type CellType.Text as a result of this call.
nRow:
The cell row.
nCol:
The cell column.
text:
The text to show in the cell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetCellText(System.Int32,System.Int32)
Returns the text shown by this cell, if the cell's type is CellType.Text or CellType.ParameterText or CellType.CustomField.
Remarks:
For standard view schedules, to read the formatted text of the cell regardless of cell type,
use Autodesk::Revit::DB::ViewSchedule::GetCellText().
nRow:
The cell row.
nCol:
The cell column.
Returns:
The text in the cell, or an empty string if the type if not CellType.Text or CellType.ParameterText or CellType.CustomField.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.

Autodesk.Revit.DB.TableSectionData.IsValidImageSymbolId(Autodesk.Revit.DB.ElementId)
Identifies if the element id represents a valid ImageSymbol element.
imageSymbolId:
The element id of the image symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.TableSectionData.InsertImage(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Inserts a image in the given cell.
nRow:
The given row index.
nColumn:
The given column index.
imageSymbolId:
The element id of the image symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nColumn is invalid.
-or-
The image symbol id doesn't represent a valid image symbol element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014